title: SharePoint File Uploads
id: 162b7a4f-4d32-4d05-bc8b-37fb586aa1a0
status: experimental
description: Detects file uploads to SharePoint in Microsoft 365 audit logs.
references:
    - https://support.scythe.io/knowledge/m365-sharepoint-document-spray
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/04/29
tags:
    - attack.execution
    - attack.t1059.009
    - attack.collection
    - attack.t1213.002
logsource:
    category: audit
    product: m365
detection:
    selection_upload:
        Operation|contains:
            - 'FileUploaded'
            - 'Uploaded File'
    selection_workload:
        Workload|contains:
            - 'SharePoint'
    condition: all of selection_*
falsepositives:
    - Legitimate file uploads
level: medium