title: Suspicious Mailbox Permission Delegation in Microsoft 365
id: 539170d6-ea17-493c-a3fb-4dc7f04f1042
status: experimental
description: Detects mailbox permission delegation operations in Microsoft 365 audit logs. Adversaries may add themselves as owners or delegates to mailboxes to maintain persistent access to email communications for intelligence gathering.
references:
    - https://support.scythe.io/knowledge/m365
author: Tyler Casey, SCYTHE
date: 2024-03-27
tags:
    - attack.persistence
    - attack.t1098.002
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        EventSource: 'UnifiedAuditLog'
        Operation|contains:
            - 'Add owner to application'
            - 'delegate mailbox permissions'
    condition: selection
falsepositives:
    - Legitimate mailbox permission delegation by administrators
level: medium
