title: AppleJeus Malware C2 Network Connection
id: abb6e0a3-d37e-4b48-978c-acdcdd9436b4
status: experimental
description: Detects network connections to known AppleJeus malware command-and-control IP addresses. AppleJeus is a sophisticated backdoor attributed to North Korean threat actors (Lazarus Group) used to target cryptocurrency organizations.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa21-048a
author: Tyler Casey, SCYTHE
date: 2024-03-13
tags:
    - attack.t1071.001
logsource:
    product: windows
    category: network_connection
detection:
    selection:
        DestinationIp:
            - '45.199.63.220'
            - '107.187.66.103'
            - '145.249.106.19'
            - '175.29.32.160'
            - '185.142.236.213'
            - '185.181.104.82'
            - '198.251.83.27'
            - '208.91.197.46'
            - '209.99.64.18'
            - '45.33.2.79'
            - '45.33.23.183'
            - '45.56.79.23'
            - '45.79.19.196'
            - '96.126.123.244'
            - '146.112.61.107'
            - '184.168.221.40'
            - '184.168.221.57'
            - '198.187.29.20'
            - '198.54.117.197'
            - '198.54.117.198'
            - '198.54.117.199'
            - '198.54.117.200'
            - '198.58.118.167'
            - '104.168.167.16'
            - '198.54.115.51'
            - '198.54.114.237'
    condition: selection
falsepositives:
    - Unlikely
level: critical
