title: CMDLine File Transfer - Process Creation
id: 41138321-4ec6-4284-8485-c8587f683ed4
status: experimental
description: Detects command-line execution of file transfer utilities, such as wget and curl.
references:
    - https://support.scythe.io/knowledge/cloudfox-v2
    - https://www.icds.psu.edu/roar-user-guide/how-to-transfer-data-at-the-command-line/#:~:text=There%20are%20two%20main%20command,%2C%20copies%20them%2C%20and%20exits.
    
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/06/28
tags:
    - attack.command_and_control
    - attack.t1105
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith:
            - '/wget'
            - '/curl'
            - '/scp'
            - '/aria2c'
            - '/rclone'
    condition: selection
falsepositives:
    - Legitimate files being transferred.
level: medium
