title: Command Shell Spawned from PDF Viewer Application
id: 9e1ab35a-abc8-48f7-8b9e-320da08bed16
status: experimental
description: Detects command shell processes (cmd.exe or PowerShell) being spawned from PDF viewer applications while processing PDF files. This behavior may indicate exploitation of a PDF viewer vulnerability or a malicious PDF document executing embedded scripts.
references:
    - https://support.scythe.io/knowledge/empower-threat-feb2024-coldriver-spica
    - https://attack.mitre.org/techniques/T1204/002/
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/02/28
tags:
    - attack.execution
    - attack.t1059
    - attack.t1204.002
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent_img:
        ParentImage|endswith:
            - '\msedge.exe'
            - '\AcroRd32.exe'
            - '\Acrobat.exe'
            - '\FoxitReader.exe'
            - '\FoxitPDFReader.exe'
            - '\SumatraPDF.exe'
    selection_parentcmd:
        ParentCommandLine|contains:
            - '.pdf'
    selection_img:
        Image|endswith:
            - '\cmd.exe'
            - '\powershell.exe'
            - '\pwsh.exe'
    condition: selection_parent_img and selection_parentcmd and selection_img
falsepositives:
    - Legitimate PDF automation workflows that invoke command shells.
level: high
