title: Modify File Permissions to Executable
id: 1162a55c-b682-4833-8e9e-bb4b6ce947b9
status: experimental
description: Detects a file being modified via chmod to then be executable.
references:
    - https://support.scythe.io/knowledge/systemd-persistence
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024-06-28
tags:
    - attack.execution
    - attack.t1059.004
logsource:
    category: process_creation
    product: linux
detection:
    selection_img:
        Image|endswith: 'chmod'
    selection_code:
        CommandLine|contains:
            - '+x'
            - '777'
            - '755'
            - '644'
    condition: all of selection_*
falsepositives:
    - Legitimate files being modified.
level: low
