title: Registry Values set via CMD or PoSH
id: bb7b4970-db14-4e44-a501-0d99021d50ef
status: experimental
description: Detects PowerShell or CMD processes that are attempting to set or delete registry values.
references:
    - https://support.scythe.io/knowledge/powershell-profile-persistence
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/09/03
tags:
    - attack.execution
    - attack.t1059.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        - OriginalFileName:
              - 'PowerShell.EXE'
              - 'pwsh.dll'
              - 'Cmd.exe'
        - Image|endswith:
              - '\powershell.exe'
              - '\pwsh.exe'
              - '\cmd.exe'
    selection_reg:
        CommandLine|contains:
            - ' reg '
    selection_cmdline:
        CommandLine|contains:
            - ' add '
            - ' delete '
    condition: all of selection_*
falsepositives:
    - Administrators setting registry values via scripts or cmdline execution.
level: medium
