title: Enable Service via systemctl
id: 7a074483-d40d-4c1a-b98e-f092f9a0015b
status: experimental
description: Detects a service being enabled via systemctl.  This could be indicative of an adversary enabling a service as a persistence mechanism.
references:
    - https://support.scythe.io/knowledge/systemd-persistence
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/06/28
tags:
    - attack.persistence
    - attack.t1543.002
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: '/systemctl'
        CommandLine|contains: 'enable'
    condition: selection
falsepositives:
    - Legitimate service being enabled.
level: low
