title: StopCrypt Ransomware Command Line Parameters
id: 29c87ffe-bb8b-49cc-9409-582d112c84d0
status: experimental
description: Detects process execution with command-line parameters characteristic of StopCrypt ransomware (--Admin IsNotAutoStart IsNotTask). These specific parameters are used by the malware to determine its execution context.
references:
    - https://blog.sonicwall.com/en-us/2024/03/new-multi-stage-stopcrypt-ransomware/
author: Tyler Casey, SCYTHE
date: 2024-04-04
tags:
    - attack.execution
    - attack.t1059
    - attack.impact
    - attack.t1486
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        CommandLine|contains: '--Admin IsNotAutoStart IsNotTask'
    condition: selection
falsepositives:
    - Unlikely
level: critical
