title: Docker Load Container
id: 735d6acc-7ed0-4ffb-bb18-c136cf6dd1b8
status: experimental
description: Detects loading a Docker container image. Adversaries may use containers to introduce malicious software or bypass security controls, potentially leading to unauthorized access or data breaches.
references:
    - https://support.scythe.io/knowledge/malicious-docker-container
tags:
    - attack.execution
    - attack.t1610
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/09/04
logsource:
    category: process_creation
    product: linux
detection:
    selection_docker:
        CommandLine|contains: 'docker'
    selection_load:
        CommandLine|contains: ' load '
    condition: all of selection_*
falsepositives:
    - Legitimate containers being loaded.
level: low
