title: Raspberry Robin Malware Process Creation by Hash
id: c8df6647-9286-46e5-89b7-4b6eac808f9f
status: experimental
description: Detects process creation events matching known SHA256 and MD5 hashes associated with Raspberry Robin malware. Raspberry Robin is a worm that spreads via USB drives and has been linked to pre-ransomware activity.
references:
    - https://www.microsoft.com/en-us/security/blog/2022/10/27/raspberry-robin-worm-part-of-larger-ecosystem-facilitating-pre-ransomware-activity/
author: Tyler Casey, SCYTHE
date: 2024-02-21
tags:
    - attack.t1204.002
    - attack.t1091
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Hashes|contains:
            - 'SHA256=d1224c08da923517d65c164932ef8d931633e5376f74bf0655b72d559cc32fd2'
            - 'SHA256=0b214297e87360b3b7f6d687bdd7802992bc0e89b170d53bf403e536e07e396e'
            - 'SHA256=f18a54ba72df1a17daf21b519ffeee8463cfc81c194a8759a698709f1c9a3e87'
            - 'SHA256=0c435aadaa3c42a71ad8ff80781def4c8ce085f960d75f15b6fee8df78b2ac38'
            - 'SHA256=1789ba9965adc0c51752e81016aec5749377ec86ec9a30449b52b1a5857424bf'
            - 'SHA256=5c15151a29fab8a2d58fa55aa6c88a58a456b0a6bc959b843e9ceb2295c61885'
            - 'SHA256=09247f88d47b69e8d50f0fe4c10c7f0ecc95c979a38c2f7dfee4aec3679b5807'
            - 'SHA256=f0115a8c173d30369acc86cb8c68d870c8cf8a2b0b74d72f9dbba30d80f05614'
            - 'SHA256=7e39dcd15307e7de862b9b42bf556f2836bf7916faab0604a052c82c19e306ca'
            - 'MD5=6f5ea8383bc3bd07668a7d24fe9b0828'
            - 'MD5=e8f0d33109448f877a0e532b1a27131a'
    condition: selection
falsepositives:
    - Unlikely
level: critical
