title: Windows Script Host Spawns Notepad++
id: c3e0bc2a-f4f4-4913-b852-e719a4967ba6
status: experimental
description: Detects wscript.exe or cmd.exe spawning Notepad++, a behavior associated with Pikabot malware. This technique uses legitimate applications as intermediaries to eventually execute malicious code through Notepad++ plugins.
references:
    - https://support.scythe.io/knowledge/empower-1-feb2024-pikabot
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/02/27
tags:
    - attack.execution
    - attack.t1059
    - attack.t1059.005
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent_img:
        ParentImage|endswith:
            - '\wscript.exe'
            - '\cscript.exe'
    selection_process:
        Image|endswith:
            - '\notepad++.exe'
    condition: selection_parent_img and selection_process
falsepositives:
    - Automation scripts that legitimately launch Notepad++ for text processing.
level: high
