title: Wscript or Cmd Spawning Notepad++ Process
id: c3e0bc2a-f4f4-4913-b852-e719a4967ba6
status: experimental
description: Detects wscript.exe or cmd.exe spawning Notepad++. This behavior has been associated with Pikabot malware, which uses script files to launch Notepad++ as part of its infection chain.
references:
    - https://support.scythe.io/knowledge/empower-1-feb2024-pikabot
author: Tyler Casey, SCYTHE
date: 2024-02-27
tags:
    - attack.execution
    - attack.t1059.005
    - attack.t1059.003
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent:
        ParentImage|endswith:
            - '\cmd.exe'
            - '\wscript.exe'
    selection_child:
        - Image|endswith: '\notepad++.exe'
        - CommandLine|contains: 'notepad++.exe'
    condition: all of selection_*
falsepositives:
    - Legitimate scripts launching Notepad++
level: medium
