title: Suspicious Run Key Creation
id: 44fec743-072b-425f-ab1e-1a8549c153de
status: experimental
description: Detects windows run keys being created or modified via the "Set-ItemProperty" CMDLet.
references:
    - https://support.scythe.io/knowledge/sharpdragon
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/07/08
tags:
    - attack.execution
    - attack.t1059.001
    - attack.persistence
    - attack.t1547.001
logsource:
    product: windows
    category: proc_creation
detection:
    selection_img:
        Image|endswith:
            - '\powershell.exe'
            - '\cmd.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'Set-ItemProperty'
            - 'Set-Item'
    selection_runkey:
        CommandLine|contains:
            - '\Software\Microsoft\Windows\CurrentVersion\Run'
    condition: all of selection_*
falsepositives:
    - Legitimate creation of Run Keys via PowerShell
level: medium
