title: Microsoft 365 User Account Creation
id: faed11fe-d240-4fe9-9c3f-1641cb774dcb
status: experimental
description: Detects the creation of new user accounts in Microsoft 365 via the Unified Audit Log. Unexpected user creation may indicate an attacker establishing persistence or creating backdoor accounts for future access.
references:
    - https://support.scythe.io/knowledge/m365
    - https://learn.microsoft.com/en-us/purview/audit-log-activities
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/03/27
tags:
    - attack.persistence
    - attack.t1136.003
logsource:
    product: m365
    service: threat_management
detection:
    selection:
        EventSource:
            - UnifiedAuditLog
        Operation|contains:
            - 'User added'
    condition: selection
falsepositives:
    - Legitimate user provisioning by IT administrators.
level: low
