title: CMDLine File Transfer - Network Connection
id: 97d19e97-d09a-49e6-9420-311881cfb316
status: experimental
description: Detects a network connection from file transfer utilities, such as wget and curl.
references:
    - https://support.scythe.io/knowledge/cloudfox-v2
    - https://www.icds.psu.edu/roar-user-guide/how-to-transfer-data-at-the-command-line/#:~:text=There%20are%20two%20main%20command,%2C%20copies%20them%2C%20and%20exits.
    
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/06/28
tags:
    - attack.command-and-control
    - attack.t1105
logsource:
    product: linux
    category: network_connection
detection:
    selection:
        Image|endswith:
            - '/wget'
            - '/curl'
            - '/scp'
            - '/aria2c'
            - '/rclone'
    condition: selection
falsepositives:
    - Legitimate files being transferred.
level: medium
