title: Suspicious Scheduled Task Creation via Command Line
id: 1c001601-0563-4458-99c2-7addad4fe601
status: experimental
description: Detects the creation of scheduled tasks via PowerShell cmdlets (New-ScheduledTask) or schtasks.exe through command shell processes. Attackers commonly use scheduled tasks to establish persistence or execute malicious payloads at specific times.
references:
    - https://support.scythe.io/knowledge/empower-threat-feb2024-coldriver-spica
    - https://attack.mitre.org/techniques/T1053/005/
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/02/28
tags:
    - attack.execution
    - attack.persistence
    - attack.t1059
    - attack.t1053.005
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        Image|endswith:
            - '\powershell.exe'
            - '\pwsh.exe'
            - '\cmd.exe'
    selection_cmdline:
        CommandLine|contains:
            - 'New-ScheduledTask'
            - 'Register-ScheduledTask'
            - 'SCHTASKS'
            - '/CREATE'
    condition: selection_img and selection_cmdline
falsepositives:
    - IT administrators creating scheduled tasks for legitimate system maintenance.
level: medium
