title: PPLBlade LSASS Bypass Tool Execution
id: 47b5cf6d-bffb-48b9-8fcc-b4b0cb0dd566
status: experimental
description: Detects execution of PPLBlade, a tool designed to bypass Protected Process Light (PPL) protection to dump LSASS memory and extract credentials. The tool uses specific command-line parameters (--mode, --handle, --obfuscate) to perform its operations.
references:
    - https://github.com/tastypepperoni/PPLBlade
    - https://tastypepperoni.medium.com/bypassing-defenders-lsass-dump-detection-and-ppl-protection-in-go-7dd85d9a32e6
author: Tyler Casey, SCYTHE
date: 2024-02-05
tags:
    - attack.t1003.001
logsource:
    product: windows
    category: process_creation
detection:
    selection_img:
        Image|endswith: '\PPLBlade.exe'
    selection_cmdline:
        CommandLine|contains:
            - '--mode'
            - '--handle'
            - '--obfuscate'
    condition: selection_img or selection_cmdline
falsepositives:
    - Unlikely
level: critical
