title: Local User Account Creation via New-LocalUser PowerShell Cmdlet
id: 88c38101-0568-44bd-89b0-5b6d20edb8e7
status: experimental
description: Detects the use of PowerShell's New-LocalUser cmdlet to create local user accounts. Attackers may create local accounts to establish persistence or backdoor access to compromised systems.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-353a
    - https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.localaccounts/new-localuser
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/03/28
tags:
    - attack.persistence
    - attack.t1136.001
    - attack.defense-evasion
    - attack.t1078.003
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith:
            - '\powershell.exe'
            - '\powershell_ise.exe'
            - '\pwsh.exe'
        CommandLine|contains:
            - 'New-LocalUser'
    condition: selection
falsepositives:
    - IT administrators creating local accounts for legitimate purposes.
level: medium
