title: Chrome Electron Proxy Execution via Command Line
id: 13a288d4-be25-483e-bcad-2707f7f450c5
related:
    - id: 4007bc45-1727-405d-a7bc-4b3d441bf08f
      type: similar
status: experimental
description: Detects attempted proxy execution of commands through Google Chrome using the --utility-cmd-prefix parameter. This technique abuses Electron-based applications to execute arbitrary commands while evading security controls that may not monitor Chrome child processes.
references:
    - https://medium.com/@MalFuzzer/one-electron-to-rule-them-all-dc2e9b263daf
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/03/05
tags:
    - attack.execution
    - attack.t1059
    - attack.defense_evasion
    - attack.t1218
logsource:
    product: windows
    category: process_creation
detection:
    selection_parent_img:
        ParentImage|endswith:
            - '\powershell.exe'
            - '\cmd.exe'
    selection_img:
        Image|endswith:
            - '\chrome.exe'
    selection_cmdline:
        CommandLine|contains:
            - '--utility-cmd-prefix'
    condition: all of selection_*
falsepositives:
    - Unlikely in standard environments; this is an abuse of Chrome's internal functionality.
level: medium
