title: Administrative User Creation
id: 1990b3a1-f0e1-4dd6-8b35-7bba7db819d8
status: experimental
description: Detects a user being created and added to an administrative group (sudo).
references:
    - https://cloud.google.com/blog/topics/threat-intelligence/initial-access-brokers-exploit-f5-screenconnect
    - https://support.scythe.io/knowledge/unc5174-ioc
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/06/27
tags:
    - attack.persistence
    - attack.t1136
logsource:
    category: process_creation
    product: linux
detection:
    selection:
        Image|endswith: '/useradd'
        CommandLine|contains: 'sudo'
    condition: selection
falsepositives:
    - Legitimate administrative account creation.
level: low
