title: Registry Run Key Modification
id: 65cd0d2b-b9f6-4562-80d3-fbb69091389f
status: experimental
description: Detects modifications to the Windows Registry Run and RunOnce keys, which are commonly used by malware to establish persistence. These keys cause programs to execute automatically when a user logs on.
references:
    - https://www.volexity.com/blog/2023/06/28/charming-kitten-updates-powerstar-with-an-interplanetary-twist/
    - https://attack.mitre.org/techniques/T1547/001/
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/07/24
tags:
    - attack.persistence
    - attack.t1547.001
logsource:
    product: windows
    category: registry_set
detection:
    selection:
        TargetObject|contains:
            - '\Software\Microsoft\Windows\CurrentVersion\Run\'
            - '\Software\Microsoft\Windows\CurrentVersion\RunOnce\'
    filter_defender:
        TargetObject|contains:
            - '\Services\WinDefend'
    condition: selection and not filter_defender
falsepositives:
    - Legitimate software installations that add startup entries.
level: medium
