title: LockBit 3.0 Ransomware Registry Modifications
id: bbe4ab32-4862-4227-a607-0f68f5bae418
status: experimental
description: Detects registry modifications associated with LockBit 3.0 ransomware including disabling SmartScreen, enabling auto-logon, disabling Windows Defender real-time protection, disabling Windows Event Logging, and disabling Windows Firewall.
references:
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-075a
author: Tyler Casey, SCYTHE
date: 2023-12-21
tags:
    - attack.t1562.001
    - attack.t1562.004
    - attack.t1547.001
logsource:
    product: windows
    category: registry_set
detection:
    selection_smartscreen:
        TargetObject|contains: '\SOFTWARE\Policies\Microsoft\Windows\System\EnableSmartScreen'
        Details: 'DWORD (0x00000000)'
    selection_eventlog:
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows\CurrentVersion\WINEVT\Channels\'
        TargetObject|endswith: '\Enabled'
        Details: 'DWORD (0x00000000)'
    selection_autologon:
        TargetObject|contains: '\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon\AutoAdminLogon'
        Details: 'DWORD (0x00000001)'
    selection_defender:
        TargetObject|contains: '\SOFTWARE\Policies\Microsoft\Windows Defender\Real-Time Protection\DisableRealtimeMonitoring'
        Details: 'DWORD (0x00000001)'
    selection_firewall:
        TargetObject|contains: '\SOFTWARE\Policies\Microsoft\WindowsFirewall\'
        TargetObject|endswith: '\EnableFirewall'
        Details: 'DWORD (0x00000000)'
    condition: 1 of selection_*
falsepositives:
    - Legitimate system configuration changes by administrators
level: high
