title: LockBit 3.0 Ransomware File Extension Detection
id: 89240a30-5ba7-4101-a6f2-7e6167bba026
status: experimental
description: Detects file creation with the .HLJkNskOq extension, which is the default encrypted file extension used by LockBit 3.0 ransomware. Multiple files with this extension indicate active ransomware encryption.
references:
    - https://www.trendmicro.com/en_th/research/22/g/lockbit-ransomware-group-augments-its-latest-variant--lockbit-3-.html
    - https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-075a
author: Tyler Casey @1qazCasey, @scythe_io
date: 2024/01/16
tags:
    - attack.impact
    - attack.t1486
logsource:
    product: windows
    category: file_event
detection:
    selection:
        TargetFilename|endswith:
            - '.HLJkNskOq'
    condition: selection
falsepositives:
    - Unlikely; this file extension is specific to LockBit 3.0 ransomware.
level: critical
